Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4A.xml
          </instance>
        </module>
        <module name="HMATRIXB" id="I7638" version="1.3.0">
          <instance name="HMATRIX">
            <register-group name="HMATRIX" name-in-module="HMATRIXB" address-space="base" offset="0x400A1000"/>
            <parameters>
              <param name="MASTER_NUM" value="6"/>
              <param name="MASTER_CPU_IDCODE" value="0"/>
              <param name="MASTER_CPU_SYS" value="1"/>
              <param name="MASTER_SMAP" value="2"/>
              <param name="MASTER_PDCA" value="3"/>
              <param name="MASTER_USBC" value="4"/>
              <param name="MASTER_CRCCU" value="5"/>
              <param name="SLAVE_NUM" value="7"/>
              <param name="SLAVE_FLASH" value="0"/>
              <param name="SLAVE_HTOP0" value="1"/>
              <param name="SLAVE_HTOP1" value="2"/>
              <param name="SLAVE_HTOP2" value="3"/>
              <param name="SLAVE_HTOP3" value="4"/>
              <param name="SLAVE_HRAMC0" value="5"/>
              <param name="SLAVE_HRAMC1" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="IISC" id="I7560" version="1.0.0">
          <instance name="IISC">
            <register-group name="IISC" name-in-module="IISC" address-space="base" offset="0x40004000"/>
            <signals>
              <signal group="IMCK" function="D" pad="PB05"/>
              <signal group="IMCK" function="D" pad="PC14"/>
              <signal group="IMCK" function="B" pad="PA31"/>
              <signal group="ISCK" function="D" pad="PB02"/>
              <signal group="ISCK" function="D" pad="PC09"/>
              <signal group="ISCK" function="B" pad="PA27"/>
              <signal group="ISDI" function="D" pad="PB03"/>
              <signal group="ISDI" function="D" pad="PC10"/>
              <signal group="ISDI" function="B" pad="PA28"/>
              <signal group="ISDO" function="D" pad="PB04"/>
              <signal group="ISDO" function="D" pad="PC13"/>
              <signal group="ISDO" function="B" pad="PA30"/>
              <signal group="IWS" function="D" pad="PB06"/>
              <signal group="IWS" function="D" pad="PC12"/>
              <signal group="IWS" function="B" pad="PA29"/>
            </signals>
            <parameters>
              <param name="GCLK_NUM" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="PARC" id="I7570" version="1.0.0">
          <instance name="PARC">
            <register-group name="PARC" name-in-module="PARC" address-space="base" offset="0x4006C000"/>
            <signals>
              <signal group="PCCK" function="D" pad="PA17"/>
              <signal group="PCCK" function="D" pad="PC21"/>
              <signal group="PCDATA" index="0" function="D" pad="PA09"/>
              <signal group="PCDATA" index="0" function="D" pad="PC24"/>
              <signal group="PCDATA" index="1" function="D" pad="PA10"/>
              <signal group="PCDATA" index="1" function="D" pad="PC25"/>
              <signal group="PCDATA" index="2" function="D" pad="PA11"/>
              <signal group="PCDATA" index="2" function="D" pad="PC26"/>
              <signal group="PCDATA" index="3" function="D" pad="PA12"/>
              <signal group="PCDATA" index="3" function="D" pad="PC27"/>
              <signal group="PCDATA" index="4" function="D" pad="PA13"/>
              <signal group="PCDATA" index="4" function="D" pad="PC28"/>
              <signal group="PCDATA" index="5" function="D" pad="PA14"/>
              <signal group="PCDATA" index="5" function="D" pad="PC29"/>
              <signal group="PCDATA" index="6" function="D" pad="PA15"/>
              <signal group="PCDATA" index="6" function="D" pad="PC30"/>
              <signal group="PCDATA" index="7" function="D" pad="PA16"/>
              <signal group="PCDATA" index="7" function="D" pad="PC31"/>
              <signal group="PCEN1" function="D" pad="PA18"/>
              <signal group="PCEN1" function="D" pad="PC22"/>
              <signal group="PCEN2" function="D" pad="PA19"/>
              <signal group="PCEN2" function="D" pad="PC23"/>
            </signals>
          </instance>
        </module>
        <module name="PDCA" id="I7514" version="1.2.4">
          <instance name="PDCA">
            <register-group name="PDCA" name-in-module="PDCA" address-space="base" offset="0x400A2000"/>
            <parameters>
              <param name="CHANNEL_LENGTH" value="16"/>
              <param name="MON_CH0_IMPL" value="0"/>
              <param name="MON_CH1_IMPL" value="0"/>
            </parameters>
          </instance>
        </module>
        <module name="PEVC" id="I7533" version="2.0.0">
          <instance name="PEVC">
            <register-group name="PEVC" name-in-module="PEVC" address-space="base" offset="0x400A6000"/>
            <signals>
              <signal group="PAD_EVT" index="0" function="C" pad="PA08"/>
              <signal group="PAD_EVT" index="0" function="C" pad="PB12"/>
              <signal group="PAD_EVT" index="0" function="C" pad="PC07"/>
              <signal group="PAD_EVT" index="0" function="C" pad="PC24"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PA09"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PB13"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PC08"/>
              <signal group="PAD_EVT" index="1" function="C" pad="PC25"/>
              <signal group="PAD_EVT" index="2" function="C" pad="PA10"/>
              <signal group="PAD_EVT" index="2" function="C" pad="PC11"/>
              <signal group="PAD_EVT" index="2" function="C" pad="PC26"/>
              <signal group="PAD_EVT" index="2" function="B" pad="PB09"/>
              <signal group="PAD_EVT" index="3" function="C" pad="PA11"/>
              <signal group="PAD_EVT" index="3" function="C" pad="PC27"/>
              <signal group="PAD_EVT" index="3" function="B" pad="PB10"/>
            </signals>
            <parameters>
              <param name="EVIN_BITS" value="31"/>
              <param name="PADS_BITS" value="4"/>
              <param name="TRIGOUT_BITS" value="19"/>
            </parameters>
          </instance>
        </module>
        <module name="PICOUART" id="I8403" version="1.0.1">
          <instance name="PICOUART">
            <register-group name="PICOUART" name-in-module="PICOUART" address-space="base" offset="0x400F1400"/>
