Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4A.xml
        <register name="INTCH" offset="0x40" rw="R" size="4" count="1" count-param="STATUS_REG_NUMBER" initval="0x00000000" caption="In-Touch Status Register">
          <bitfield name="INTCH" caption="In-Touch" mask="0xFFFFFFFF"/>
        </register>
        <register name="INTCHCLR" offset="0x50" rw="W" size="4" count="1" count-param="STATUS_REG_NUMBER" initval="0x00000000" caption="In-Touch Status Clear Register">
          <bitfield name="INTCHCLR" caption="In-Touch Clear" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTCH" offset="0x60" rw="R" size="4" count="1" count-param="STATUS_REG_NUMBER" initval="0x00000000" caption="Out-of-Touch Status Register">
          <bitfield name="OUTTCH" caption="Out-of-Touch" mask="0xFFFFFFFF"/>
        </register>
        <register name="OUTTCHCLR" offset="0x70" rw="W" size="4" count="1" count-param="STATUS_REG_NUMBER" initval="0x00000000" caption="Out-of-Touch Status Clear Register">
          <bitfield name="OUTTCHCLR" caption="Out of Touch" mask="0xFFFFFFFF"/>
        </register>
        <register name="PARAMETER" offset="0xf8" rw="R" size="4" caption="Parameter Register">
          <bitfield name="NPINS" caption="Number of Pins" mask="0xFF"/>
          <bitfield name="NSTATUS" caption="Number of Status bits" mask="0xFF00"/>
          <bitfield name="FRACTIONAL" caption="Number of Fractional bits" mask="0xF0000"/>
        </register>
        <register name="VERSION" offset="0xfc" rw="R" size="4" initval="0x00000100" caption="Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="CHIPID" version="1.0.0" caption="Chip ID Registers">
      <register-group name="CHIPID" caption="Chip ID Registers">
        <register name="CIDR" offset="0x340" rw="R" size="4" initval="0xAB0A09E0" caption="Chip ID Register">
        </register>
        <register name="EXID" offset="0x344" rw="R" size="4" initval="0x02000002" caption="Chip ID Extension Register">
        </register>
      </register-group>
    </module>
    <module name="CRCCU" id="I7644" version="2.0.2" caption="CRC Calculation Unit">
      <register-group name="CRCCU" caption="CRC Calculation Unit">
        <register name="DSCR" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Descriptor Base Register">
          <bitfield name="DSCR" caption="Description Base Address" mask="0xFFFFFE00"/>
        </register>
        <register name="DMAEN" offset="0x8" rw="W" size="4" initval="0x00000000" caption="DMA Enable Register">
          <bitfield name="DMAEN" caption="DMA Enable" mask="0x1"/>
        </register>
        <register name="DMADIS" offset="0xc" rw="W" size="4" initval="0x00000000" caption="DMA Disable Register">
          <bitfield name="DMADIS" caption="DMA Disable" mask="0x1"/>
        </register>
        <register name="DMASR" offset="0x10" rw="R" size="4" initval="0x00000000" caption="DMA Status Register">
          <bitfield name="DMASR" caption="DMA Channel Status" mask="0x1"/>
        </register>
        <register name="DMAIER" offset="0x14" rw="W" size="4" initval="0x00000000" caption="DMA Interrupt Enable Register">
          <bitfield name="DMAIER" caption="DMA Interrupt Enable" mask="0x1"/>
        </register>
        <register name="DMAIDR" offset="0x18" rw="W" size="4" initval="0x00000000" caption="DMA Interrupt Disable Register">
          <bitfield name="DMAIDR" caption="DMA Interrupt Disable" mask="0x1"/>
        </register>
        <register name="DMAIMR" offset="0x1c" rw="R" size="4" initval="0x00000000" caption="DMA Interrupt Mask Register">
          <bitfield name="DMAIMR" caption="DMA Interrupt Mask" mask="0x1"/>
        </register>
        <register name="DMAISR" offset="0x20" rw="R" size="4" initval="0x00000000" caption="DMA Interrupt Status Register">
          <bitfield name="DMAISR" caption="DMA Interrupt Status" mask="0x1"/>
        </register>
        <register name="CR" offset="0x34" rw="W" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="RESET" caption="Reset CRCComputation" mask="0x1"/>
        </register>
        <register name="MR" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="ENABLE" caption="CRC Computation Enable" mask="0x1"/>
          <bitfield name="COMPARE" caption="CRC Compare" mask="0x2"/>
          <bitfield name="PTYPE" caption="Polynomial Type" mask="0xC" values="CRCCU_MR__PTYPE"/>
          <bitfield name="DIVIDER" caption="Bandwidth Divider" mask="0xF0"/>
        </register>
        <register name="SR" offset="0x3c" rw="R" size="4" initval="0xFFFFFFFF" caption="Status Register">
          <bitfield name="CRC" caption="Cyclic Redundancy Check Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="IER" offset="0x40" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="ERRIER" caption="CRC Error Interrupt Enable" mask="0x1"/>
        </register>
        <register name="IDR" offset="0x44" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="ERRIDR" caption="CRC Error Interrupt Disable" mask="0x1"/>
        </register>
        <register name="IMR" offset="0x48" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="ERRIMR" caption="CRC Error Interrupt Mask" mask="0x1"/>
        </register>
        <register name="ISR" offset="0x4c" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="ERRISR" caption="CRC Error Interrupt Status" mask="0x1"/>
        </register>
        <register name="VERSION" offset="0xfc" rw="R" size="4" initval="0x00000202" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
