Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4A.xml
        <register name="IER" offset="0x20" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="RCZ" caption="Reload Counter Zero" mask="0x1"/>
          <bitfield name="TRC" caption="Transfer Complete" mask="0x2"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x4"/>
        </register>
        <register name="IDR" offset="0x24" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="RCZ" caption="Reload Counter Zero" mask="0x1"/>
          <bitfield name="TRC" caption="Transfer Complete" mask="0x2"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x4"/>
        </register>
        <register name="IMR" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="RCZ" caption="Reload Counter Zero" mask="0x1"/>
          <bitfield name="TRC" caption="Transfer Complete" mask="0x2"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x4"/>
        </register>
        <register name="ISR" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="RCZ" caption="Reload Counter Zero" mask="0x1"/>
          <bitfield name="TRC" caption="Transfer Complete" mask="0x2"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x4"/>
        </register>
      </register-group>
      <register-group name="PDCA" caption="Peripheral DMA Controller">
        <register-group name="channel" name-in-module="channel" offset="0x000" count="16" count-param="CHANNEL_LENGTH"/>
        <register name="PCONTROL" offset="0x800" rw="RW" size="4" initval="0x00000000" caption="Performance Control Register">
          <bitfield name="CH0EN" caption="Channel 0 Enabled" mask="0x1"/>
          <bitfield name="CH1EN" caption="Channel 1 Enabled." mask="0x2"/>
          <bitfield name="CH0OF" caption="Channel 0 Overflow Freeze" mask="0x10"/>
          <bitfield name="CH1OF" caption="Channel 1 overflow freeze" mask="0x20"/>
          <bitfield name="CH0RES" caption="Channel 0 counter reset" mask="0x100"/>
          <bitfield name="CH1RES" caption="Channel 1 counter reset" mask="0x200"/>
          <bitfield name="MON0CH" caption="PDCA Channel to monitor with counter 0" mask="0x3F0000"/>
          <bitfield name="MON1CH" caption="PDCA Channel to monitor with counter 1" mask="0x3F000000"/>
        </register>
        <register name="PRDATA0" offset="0x804" rw="R" size="4" initval="0x00000000" caption="Channel 0 Read Data Cycles">
          <bitfield name="DATA" caption="Data Cycles Counted Since Last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PRSTALL0" offset="0x808" rw="R" size="4" initval="0x00000000" caption="Channel 0 Read Stall Cycles">
          <bitfield name="STALL" caption="Stall Cycles counted since last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PRLAT0" offset="0x80c" rw="R" size="4" initval="0x00000000" caption="Channel 0 Read Max Latency">
          <bitfield name="LAT" caption="Maximum Transfer Initiation cycles counted since last reset" mask="0xFFFF"/>
        </register>
        <register name="PWDATA0" offset="0x810" rw="R" size="4" initval="0x00000000" caption="Channel 0 Write Data Cycles">
          <bitfield name="DATA" caption="Data Cycles Counted since last Reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PWSTALL0" offset="0x814" rw="R" size="4" initval="0x00000000" caption="Channel 0 Write Stall Cycles">
          <bitfield name="STALL" caption="Stall cycles counted since last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PWLAT0" offset="0x818" rw="R" size="4" initval="0x00000000" caption="Channel0 Write Max Latency">
          <bitfield name="LAT" caption="Maximum transfer initiation cycles counted since last reset" mask="0xFFFF"/>
        </register>
        <register name="PRDATA1" offset="0x81c" rw="R" size="4" initval="0x00000000" caption="Channel 1 Read Data Cycles">
          <bitfield name="DATA" caption="Data Cycles Counted Since Last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PRSTALL1" offset="0x820" rw="R" size="4" initval="0x00000000" caption="Channel Read Stall Cycles">
          <bitfield name="STALL" caption="Stall Cycles Counted since last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PRLAT1" offset="0x824" rw="R" size="4" initval="0x00000000" caption="Channel 1 Read Max Latency">
          <bitfield name="LAT" caption="Maximum Transfer initiation cycles counted since last reset" mask="0xFFFF"/>
        </register>
        <register name="PWDATA1" offset="0x828" rw="R" size="4" initval="0x00000000" caption="Channel 1 Write Data Cycles">
          <bitfield name="DATA" caption="Data cycles Counted Since last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PWSTALL1" offset="0x82c" rw="R" size="4" initval="0x00000000" caption="Channel 1 Write stall Cycles">
          <bitfield name="STALL" caption="Stall cycles counted since last reset" mask="0xFFFFFFFF"/>
        </register>
        <register name="PWLAT1" offset="0x830" rw="R" size="4" initval="0x00000000" caption="Channel 1 Read Max Latency">
          <bitfield name="LAT" caption="Maximum transfer initiation cycles counted since last reset" mask="0xFFFF"/>
        </register>
        <register name="VERSION" offset="0x834" rw="R" size="4" initval="0x00000124" caption="Version Register">
          <bitfield name="VERSION" caption="Version Number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant Number" mask="0xF0000"/>
        </register>
      </register-group>
      <value-group name="PDCA_MR__SIZE">
        <value name="Byte" value="0"/>
        <value name="Half_Word" value="1"/>
        <value name="Word" value="2"/>
      </value-group>
    </module>
    <module name="PEVC" id="I7533" version="2.0.0" caption="Peripheral Event Controller">
      <register-group name="PEVC" caption="Peripheral Event Controller">
        <register name="CHSR" offset="0x0" rw="R" size="4" initval="0x00000000" caption="Channel Status Register">
          <bitfield name="CHS" caption="Channel Status" mask="0xFFFFFFFF" values="PEVC_CHSR__CHS"/>
        </register>
