Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4A.xml
      <value-group name="PM_SR__WAKE">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Disable Interrupt." value="1"/>
      </value-group>
    </module>
    <module name="SCIF" id="I7149" version="1.3.0" caption="System Control Interface">
      <register-group name="SCIF" caption="System Control Interface">
        <register name="IER" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="IDR" offset="0x4" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="IMR" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="ISR" offset="0xc" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="ICR" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Interrupt Clear Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Lock Coarse" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Lock Fine" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Lock" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 Lock Lost" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Lock" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST Lock Lost" mask="0x4000"/>
          <bitfield name="AE" caption="Access Error" mask="0x80000000"/>
        </register>
        <register name="PCLKSR" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Power and Clocks Status Register">
          <bitfield name="OSC0RDY" caption="OSC0 Ready" mask="0x1"/>
          <bitfield name="DFLL0LOCKC" caption="DFLL0 Locked on Coarse Value" mask="0x2"/>
          <bitfield name="DFLL0LOCKF" caption="DFLL0 Locked on Fine Value" mask="0x4"/>
          <bitfield name="DFLL0RDY" caption="DFLL0 Synchronization Ready" mask="0x8"/>
          <bitfield name="DFLL0RCS" caption="DFLL0 Reference Clock Stopped" mask="0x10"/>
          <bitfield name="DFLL0OOB" caption="DFLL0 Track Out Of Bounds" mask="0x20"/>
          <bitfield name="PLL0LOCK" caption="PLL0 Locked on Accurate value" mask="0x40"/>
          <bitfield name="PLL0LOCKLOST" caption="PLL0 lock lost value" mask="0x80"/>
          <bitfield name="RCFASTLOCK" caption="RCFAST Locked on Accurate value" mask="0x2000"/>
          <bitfield name="RCFASTLOCKLOST" caption="RCFAST lock lost value" mask="0x4000"/>
        </register>
        <register name="UNLOCK" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Unlock Register">
          <bitfield name="ADDR" caption="Unlock Address" mask="0x3FF"/>
          <bitfield name="KEY" caption="Unlock Key" mask="0xFF000000"/>
        </register>
        <register name="CSCR" offset="0x1c" rw="RW" size="4" initval="0x00000000" caption="Chip Specific Configuration Register">
        </register>
        <register name="OSCCTRL0" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="Oscillator Control Register">
          <bitfield name="MODE" caption="Oscillator Mode" mask="0x1"/>
          <bitfield name="GAIN" caption="Gain" mask="0x6"/>
          <bitfield name="AGC" caption="Automatic Gain Control" mask="0x8"/>
          <bitfield name="STARTUP" caption="Oscillator Start-up Time" mask="0xF00"/>
          <bitfield name="OSCEN" caption="Oscillator Enable" mask="0x10000"/>
        </register>
