Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4A.xml
        <register name="FPDIV" offset="0x70" rw="RW" size="4" caption="Fractional Prescaler DIVIDER Register">
          <bitfield name="FPDIV" caption="Fractional Prescaler Division Factor" mask="0xFFFF"/>
        </register>
        <register name="GCCTRL" offset="0x74" rw="RW" size="4" count="12" initval="0x00000000" caption="Generic Clock Control">
          <bitfield name="CEN" caption="Clock Enable" mask="0x1"/>
          <bitfield name="DIVEN" caption="Divide Enable" mask="0x2"/>
          <bitfield name="OSCSEL" caption="Clock Select" mask="0x1F00"/>
          <bitfield name="DIV" caption="Division Factor" mask="0xFFFF0000"/>
        </register>
        <register name="RCFASTVERSION" offset="0x3d8" rw="R" size="4" caption="4/8/12 MHz RC Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="GCLKPRESCVERSION" offset="0x3dc" rw="R" size="4" caption="Generic Clock Prescaler Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="PLLIFAVERSION" offset="0x3e0" rw="R" size="4" caption="PLL Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant nubmer" mask="0xF0000"/>
        </register>
        <register name="OSCIFAVERSION" offset="0x3e4" rw="R" size="4" caption="Oscillator 0 Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant nubmer" mask="0xF0000"/>
        </register>
        <register name="DFLLIFBVERSION" offset="0x3e8" rw="R" size="4" caption="DFLL Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="RCOSCIFAVERSION" offset="0x3ec" rw="R" size="4" caption="System RC Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="FLOVERSION" offset="0x3f0" rw="R" size="4" caption="Frequency Locked Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="RC80MVERSION" offset="0x3f4" rw="R" size="4" caption="80MHz RC Oscillator Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="GCLKIFVERSION" offset="0x3f8" rw="R" size="4" caption="Generic Clock Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="VERSION" offset="0x3fc" rw="R" size="4" initval="0x00000130" caption="SCIF Version Register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
      </register-group>
    </module>
    <module name="SMAP" id="I8321" version="1.0.0" caption="System Manager Access Port">
      <register-group name="SMAP" caption="System Manager Access Port">
        <register name="CR" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="Enable" mask="0x1"/>
          <bitfield name="DIS" caption="Disable" mask="0x2"/>
          <bitfield name="CRC" caption="User Page Read" mask="0x4"/>
          <bitfield name="FSPR" caption="Flash Supplementary Page Read" mask="0x8"/>
          <bitfield name="CE" caption="Chip Erase" mask="0x10"/>
        </register>
        <register name="SR" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="DONE" caption="Operation done" mask="0x1"/>
          <bitfield name="HCR" caption="Hold Core reset" mask="0x2"/>
          <bitfield name="BERR" caption="Bus error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="LCK" caption="Lock" mask="0x10"/>
          <bitfield name="EN" caption="Enabled" mask="0x100"/>
          <bitfield name="PROT" caption="Protected" mask="0x200"/>
          <bitfield name="DBGP" caption="Debugger Present" mask="0x400"/>
          <bitfield name="STATE" caption="State" mask="0x7000000"/>
        </register>
        <register name="SCR" offset="0x8" rw="W" size="4" initval="0x00000000" caption="Status Clear Register">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="HCR" caption="Hold Core Register" mask="0x2"/>
          <bitfield name="BERR" caption="Bus error" mask="0x4"/>
          <bitfield name="FAIL" caption="Failure" mask="0x8"/>
          <bitfield name="LCK" caption="Lock error" mask="0x10"/>
        </register>
        <register name="ADDR" offset="0xc" rw="RW" size="4" initval="0x00000000" caption="Address Register">
          <bitfield name="ADDR" caption="Address Value" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Length Register">
          <bitfield name="LENGTH" caption="Length Register" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Data Register">
          <bitfield name="DATA" caption="Generic data register" mask="0xFFFFFFFF"/>
        </register>
        <register name="VERSION" offset="0x28" rw="R" size="4" initval="0x00000100" caption="VERSION register">
          <bitfield name="VERSION" caption="Version number" mask="0xFFF"/>
          <bitfield name="VARIANT" caption="Variant number" mask="0xF0000"/>
        </register>
        <register name="CIDR" offset="0xf0" rw="R" size="4" caption="Chip ID Register">
          <bitfield name="VERSION" caption="Version of the Device" mask="0x1F"/>
          <bitfield name="EPROC" caption="Embedded Processor" mask="0xE0"/>
          <bitfield name="NVPSIZ" caption="Nonvolatile Program Memory Size" mask="0xF00"/>
          <bitfield name="NVPSIZ2" caption="Second Nonvolatile Program Memory Size" mask="0xF000"/>
          <bitfield name="SRAMSIZ" caption="Internal SRAM Size" mask="0x1F0000"/>
          <bitfield name="ARCH" caption="Architecture Identifier" mask="0xFE00000"/>
          <bitfield name="NVPTYP" caption="Nonvolatile Program Memory Type" mask="0x70000000"/>
          <bitfield name="EXT" caption="Extension Flag" mask="0x80000000"/>
        </register>
