Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4A.xml
      <value-group name="SPI_CR__LASTXFER">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="The current NPCS will be deasserted after the character written in TD has been transferred. When CSAAT is set, thisallows to close the communication with the current serial peripheral by raising the corresponding NPCS line as soon as TDtransfer has completed." value="1"/>
      </value-group>
      <value-group name="SPI_CR__SPIDIS">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Disables the SPI.All pins are set in input mode and no data is received or transmitted.If a transfer is in progress, the transfer is finished before the SPI is disabled.If both SPIEN and SPIDIS are equal to one when the control register is written, the SPI is disabled." value="1"/>
      </value-group>
      <value-group name="SPI_CR__SPIEN">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Enables the SPI to transfer and receive data." value="1"/>
      </value-group>
      <value-group name="SPI_CR__SWRST">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="Reset the SPI. A software-triggered hardware reset of the SPI interface is performed." value="1"/>
      </value-group>
      <value-group name="SPI_MR__LLB">
        <value name="0" caption="Local loopback path disabled." value="0"/>
        <value name="1" caption="Local loopback path enabled.LLB controls the local loopback on the data serializer for testing in Master Mode only." value="1"/>
      </value-group>
      <value-group name="SPI_MR__MODFDIS">
        <value name="0" caption="Mode fault detection is enabled." value="0"/>
        <value name="1" caption="Mode fault detection is disabled." value="1"/>
      </value-group>
      <value-group name="SPI_MR__MSTR">
        <value name="0" caption="SPI is in Slave mode." value="0"/>
        <value name="1" caption="SPI is in Master mode." value="1"/>
      </value-group>
      <value-group name="SPI_MR__PCSDEC">
        <value name="0" caption="The chip selects are directly connected to a peripheral device." value="0"/>
        <value name="1" caption="The four chip select lines are connected to a 4- to 16-bit decoder.When PCSDEC equals one, up to 15 Chip Select signals can be generated with the four lines using an external 4- to 16-bitdecoder. The Chip Select Registers define the characteristics of the 16 chip selects according to the following rules:CSR0 defines peripheral chip select signals 0 to 3.CSR1 defines peripheral chip select signals 4 to 7.CSR2 defines peripheral chip select signals 8 to 11.CSR3 defines peripheral chip select signals 12 to 15." value="1"/>
      </value-group>
      <value-group name="SPI_MR__PS">
        <value name="0" caption="Fixed Peripheral Select." value="0"/>
        <value name="1" caption="Variable Peripheral Select." value="1"/>
      </value-group>
      <value-group name="SPI_TDR__LASTXFER">
        <value name="0" caption="No effect." value="0"/>
        <value name="1" caption="The current NPCS will be deasserted after the character written in TD has been transferred. When CSAAT is set, thisallows to close the communication with the current serial peripheral by raising the corresponding NPCS line as soon as TDtransfer has completed." value="1"/>
      </value-group>
      <value-group name="SPI_SR__ENDRX">
        <value name="0" caption="The Receive Counter Register has not reached 0 since the last write in RCR or RNCR." value="0"/>
        <value name="1" caption="The Receive Counter Register has reached 0 since the last write in RCR or RNCR." value="1"/>
      </value-group>
      <value-group name="SPI_SR__ENDTX">
        <value name="0" caption="The Transmit Counter Register has not reached 0 since the last write in TCR or TNCR." value="0"/>
        <value name="1" caption="The Transmit Counter Register has reached 0 since the last write in TCR or TNCR." value="1"/>
      </value-group>
      <value-group name="SPI_SR__MODF">
        <value name="0" caption="No Mode Fault has been detected since the last read of SR." value="0"/>
        <value name="1" caption="A Mode Fault occurred since the last read of the SR." value="1"/>
      </value-group>
      <value-group name="SPI_SR__NSSR">
        <value name="0" caption="No rising edge detected on NSS pin since last read." value="0"/>
        <value name="1" caption="A rising edge occurred on NSS pin since last read." value="1"/>
      </value-group>
      <value-group name="SPI_SR__OVRES">
        <value name="0" caption="No overrun has been detected since the last read of SR." value="0"/>
        <value name="1" caption="An overrun has occurred since the last read of SR." value="1"/>
      </value-group>
      <value-group name="SPI_SR__RDRF">
        <value name="0" caption="No data has been received since the last read of RDR" value="0"/>
        <value name="1" caption="Data has been received and the received data has been transferred from the serializer to RDR since the last readof RDR." value="1"/>
      </value-group>
      <value-group name="SPI_SR__RXBUFF">
        <value name="0" caption="RCR or RNCR has a value other than 0." value="0"/>
        <value name="1" caption="Both RCR and RNCR has a value of 0." value="1"/>
      </value-group>
      <value-group name="SPI_SR__SPIENS">
        <value name="0" caption="SPI is disabled." value="0"/>
        <value name="1" caption="SPI is enabled." value="1"/>
      </value-group>
      <value-group name="SPI_SR__TDRE">
        <value name="0" caption="Data has been written to TDR and not yet transferred to the serializer." value="0"/>
        <value name="1" caption="The last data written in the Transmit Data Register has been transferred to the serializer.TDRE equals zero when the SPI is disabled or at reset. The SPI enable command sets this bit to one." value="1"/>
      </value-group>
      <value-group name="SPI_SR__TXBUFE">
        <value name="0" caption="TCR or TNCR has a value other than 0." value="0"/>
        <value name="1" caption="Both TCR and TNCR has a value of 0." value="1"/>
      </value-group>
