Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS4A.xml
        <register name="CV" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Counter Value Channel">
          <bitfield name="CV" caption="Counter Value" mask="0xFFFF" values="TC_CV__CV"/>
        </register>
        <register name="RA" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Register A Channel">
          <bitfield name="RA" caption="Register A" mask="0xFFFF" values="TC_RA__RA"/>
        </register>
        <register name="RB" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Register B Channel">
          <bitfield name="RB" caption="Register B" mask="0xFFFF" values="TC_RB__RB"/>
        </register>
        <register name="RC" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Register C Channel">
          <bitfield name="RC" caption="Register C" mask="0xFFFF" values="TC_RC__RC"/>
        </register>
        <register name="SR" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Status Register Channel">
          <bitfield name="COVFS" caption="Counter Overflow Status" mask="0x1" values="TC_SR__COVFS"/>
          <bitfield name="LOVRS" caption="Load Overrun Status" mask="0x2" values="TC_SR__LOVRS"/>
          <bitfield name="CPAS" caption="RA Compare Status" mask="0x4" values="TC_SR__CPAS"/>
          <bitfield name="CPBS" caption="RB Compare Status" mask="0x8" values="TC_SR__CPBS"/>
          <bitfield name="CPCS" caption="RC Compare Status" mask="0x10" values="TC_SR__CPCS"/>
          <bitfield name="LDRAS" caption="RA Loading Status" mask="0x20" values="TC_SR__LDRAS"/>
          <bitfield name="LDRBS" caption="RB Loading Status" mask="0x40" values="TC_SR__LDRBS"/>
          <bitfield name="ETRGS" caption="External Trigger Status" mask="0x80" values="TC_SR__ETRGS"/>
          <bitfield name="CLKSTA" caption="Clock Enabling Status" mask="0x10000" values="TC_SR__CLKSTA"/>
          <bitfield name="MTIOA" caption="TIOA Mirror" mask="0x20000" values="TC_SR__MTIOA"/>
          <bitfield name="MTIOB" caption="TIOB Mirror" mask="0x40000" values="TC_SR__MTIOB"/>
        </register>
        <register name="IER" offset="0x24" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register Channel">
          <bitfield name="COVFS" caption="Counter Overflow" mask="0x1" values="TC_IER__COVFS"/>
          <bitfield name="LOVRS" caption="Load Overrun" mask="0x2" values="TC_IER__LOVRS"/>
          <bitfield name="CPAS" caption="RA Compare" mask="0x4" values="TC_IER__CPAS"/>
          <bitfield name="CPBS" caption="RB Compare" mask="0x8" values="TC_IER__CPBS"/>
          <bitfield name="CPCS" caption="RC Compare" mask="0x10" values="TC_IER__CPCS"/>
          <bitfield name="LDRAS" caption="RA Loading" mask="0x20" values="TC_IER__LDRAS"/>
          <bitfield name="LDRBS" caption="RB Loading" mask="0x40" values="TC_IER__LDRBS"/>
          <bitfield name="ETRGS" caption="External Trigger" mask="0x80" values="TC_IER__ETRGS"/>
        </register>
        <register name="IDR" offset="0x28" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register Channel">
          <bitfield name="COVFS" caption="Counter Overflow" mask="0x1" values="TC_IDR__COVFS"/>
          <bitfield name="LOVRS" caption="Load Overrun" mask="0x2" values="TC_IDR__LOVRS"/>
          <bitfield name="CPAS" caption="RA Compare" mask="0x4" values="TC_IDR__CPAS"/>
          <bitfield name="CPBS" caption="RB Compare" mask="0x8" values="TC_IDR__CPBS"/>
          <bitfield name="CPCS" caption="RC Compare" mask="0x10" values="TC_IDR__CPCS"/>
          <bitfield name="LDRAS" caption="RA Loading" mask="0x20" values="TC_IDR__LDRAS"/>
          <bitfield name="LDRBS" caption="RB Loading" mask="0x40" values="TC_IDR__LDRBS"/>
          <bitfield name="ETRGS" caption="External Trigger" mask="0x80" values="TC_IDR__ETRGS"/>
        </register>
        <register name="IMR" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register Channel">
          <bitfield name="COVFS" caption="Counter Overflow" mask="0x1" values="TC_IMR__COVFS"/>
          <bitfield name="LOVRS" caption="Load Overrun" mask="0x2" values="TC_IMR__LOVRS"/>
          <bitfield name="CPAS" caption="RA Compare" mask="0x4" values="TC_IMR__CPAS"/>
          <bitfield name="CPBS" caption="RB Compare" mask="0x8" values="TC_IMR__CPBS"/>
          <bitfield name="CPCS" caption="RC Compare" mask="0x10" values="TC_IMR__CPCS"/>
          <bitfield name="LDRAS" caption="RA Loading" mask="0x20" values="TC_IMR__LDRAS"/>
          <bitfield name="LDRBS" caption="RB Loading" mask="0x40" values="TC_IMR__LDRBS"/>
          <bitfield name="ETRGS" caption="External Trigger" mask="0x80" values="TC_IMR__ETRGS"/>
        </register>
      </register-group>
      <register-group name="TC" caption="Timer/Counter">
        <register-group name="channel" name-in-module="channel" offset="0x00" count="3"/>
        <register name="BCR" offset="0xc0" rw="W" size="4" initval="0x00000000" caption="TC Block Control Register">
          <bitfield name="SYNC" caption="Synchro Command" mask="0x1" values="TC_BCR__SYNC"/>
        </register>
        <register name="BMR" offset="0xc4" rw="RW" size="4" initval="0x00000000" caption="TC Block Mode Register">
          <bitfield name="TC0XC0S" caption="External Clock Signal 0 Selection" mask="0x3" values="TC_BMR__TC0XC0S"/>
          <bitfield name="TC1XC1S" caption="External Clock Signal 1 Selection" mask="0xC" values="TC_BMR__TC1XC1S"/>
          <bitfield name="TC2XC2S" caption="External Clock Signal 2 Selection" mask="0x30" values="TC_BMR__TC2XC2S"/>
        </register>
        <register name="WPMR" offset="0xe4" rw="RW" size="4" initval="0x00000000" caption="Write Protect Mode Register">
          <bitfield name="WPEN" caption="Write Protect Enable" mask="0x1"/>
          <bitfield name="WPKEY" caption="Write Protect Key" mask="0xFFFFFF00"/>
        </register>
        <register name="FEATURES" offset="0xf8" rw="R" size="4" caption="Features Register">
          <bitfield name="CTRSIZE" caption="Counter Size" mask="0xFF"/>
          <bitfield name="UPDNIMPL" caption="Up Down is Implemented" mask="0x100"/>
          <bitfield name="BRPBHSB" caption="Bridge Type is PB to HSB" mask="0x200"/>
        </register>
